examples/wedge_sphere/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}

chemistryType
{
    chemistrySolver Euler2Implicit;
    chemistryThermo rho2;
}

chemistry       on;

initialChemicalTimeStep 1e-10;

modifiedTemperature on;

modifiedTemperatureCoeffs
{
    Tmin            800;
    epsilon         80;
}

chemistryVibrationCoupling
{
    model           ParkTTv;
    ParkTTvCoeffs
    {
        exponentTtr     0.7;
        sourceTermModel preferential;
        preferentialModel
        {
            factorType      constant;
            constantFactor  0.3;
            lineFittedCoeffs
            {
                vibFactor
                {
                    N2              ( 5.772e-06 0.162 );
                    O2              ( 1.136e-05 0.166 );
                    NO              ( 9.582e-05 0.19 );
                }
            }
        }
    }
    CVDVCoeffs
    {
        reciprocalU     3;
        simpleHarmonicOscillatorVibCutOff
        {
            N2              34;
            O2              27;
            NO              28;
            N2+             34;
            O2+             27;
            NO+             28;
        }
    }
}

Euler2ImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter on;
}


// ************************************************************************* //
