examples/wedge_sphere/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRho2Thermo;
    mixture         reacting2Mixture;
//    transport       constant;
    transport       BlottnerEucken;
    thermo          decoupledEnergyModes;
    energy          sensible2InternalEnergy;
    equationOfState perfect2Gas;
    specie          advancedSpecie;
}

hyLight yes;

downgradeToSingleTv yes;
downgradeToSingleTemperature no;

chemistryReader foam2ChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/hTCReactionsEarth93";

foamChemistryThermoFile "$FOAM_CASE/constant/thermoDEM_TRVE";

twoTemperatureDictFile "$FOAM_CASE/constant/thermo2TModel";

temperatureBounds
{
    Tlow    50;
    Thigh   18000;
    }

// ************************************************************************* //
