examples/wedge_sphere/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $velocityField;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($velocityInlet 0 0);
    }
    
    sphere
    {
	    type noSlip;
//      type            nonEqMaxwellSlipU;
//      accommodationCoeff 1;
//      Uwall           $velocityWall;
//      refValue        uniform $velocityWall;
//      valueFraction   uniform 1.0;
//      thermalCreep    false;
//      curvature       false;
//      value           uniform $velocityWall;
    }
    
        sphereslip
    {
	    type slip;
//      type            nonEqMaxwellSlipU;
//      accommodationCoeff 1;
//      Uwall           $velocityWall;
//      refValue        uniform $velocityWall;
//      valueFraction   uniform 1.0;
//      thermalCreep    false;
//      curvature       false;
//      value           uniform $velocityWall;
    }
    
    #include "include/boundaries"
}

// ************************************************************************* //
