examples/wedge_sphere/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $Y_O2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Y_O2;
    }
    sphere
    {
        type            zeroGradient;
    }
    sphereslip
    {
        type            zeroGradient;
    }
    
    #include "include/boundaries"
}


// ************************************************************************* //
