examples/wedge_sphere/0/Tt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Ttr;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Ttr;
    }
    
    sphere
    {
	type 		zeroGradient;
//      type            nonEqSmoluchowskiJumpT;
//      accommodationCoeff 1;
//      Twall           uniform $Tcone;
//      value           uniform $Tcone;
    }
    
        sphereslip
    {
	type 		zeroGradient;
//      type            nonEqSmoluchowskiJumpT;
//      accommodationCoeff 1;
//      Twall           uniform $Tcone;
//      value           uniform $Tcone;
    }
    
    #include "include/boundaries"
}

// ************************************************************************* //
