examples/wedge_sphere/0/Tv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tve;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tve;
    }
    
    sphere
    {
	type		zeroGradient;
//      type            nonEqSmoluchowskiJumpTvMix;
//      accommodationCoeff 1;
//      Twall           uniform $Tcone;
//      value           uniform $Tcone;
    }
        sphereslip
    {
//      type            nonEqSmoluchowskiJumpTvMix;
//      accommodationCoeff 1;
//      Twall           uniform $Tcone;
//      value           uniform $Tcone;
	type		zeroGradient;
    }
    
    #include "include/boundaries"
}

// ************************************************************************* //
