examples/wedge_sphere/0/include/boundaries
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaries;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

frontAndBack_pos
{
    type            wedge;
}

frontAndBack_neg
{
    type            wedge;
}

outlet
{
    type            zeroGradient;
}
